Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_mctm.c
/*********************************************************************************************************//**
 * @file    ht32f1653_54_mctm.c
 * @version $Rev:: 307          $
 * @date    $Date:: 2014-12-31 #$
 * @brief   This file provides all the MCTM firmware functions.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2014 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1653_54_mctm.h"

/** @addtogroup HT32F1653_54_Peripheral_Driver HT32F1653/1654 Peripheral Driver
  * @{
  */

/** @defgroup MCTM MCTM
  * @brief MCTM driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup MCTM_Private_Define MCTM private definitions
  * @{
  */
#define CNTCFR_UEV1DIS      0x00000001ul
#define CNTCFR_UGDIS        0x00000002ul
#define CNTCFR_DIR          0x01000000ul
#define CNTCFR_CMSEL_MASK   ~0x00030000ul
#define CNTCFR_CKDIV_MASK   ~0x00000300ul

#define MDCFR_SPMSET        0x01000000ul
#define MDCFR_TSE           0x00000001ul
#define MDCFR_SMSEL_MASK    ~0x00000700ul
#define MDCFR_MMSEL_MASK    ~0x00070000ul

#define TRCFR_ECME          0x01000000ul
#define TRCFR_ETI_POL       0x00010000ul
#define TRCFR_ETI_PSC_MASK  ~0x00003000ul
#define TRCFR_ETIF_MASK     ~0x00000F00ul
#define TRCFR_TRSEL_MASK    ~0x0000000Ful
#define TRCFR_ETI_CONF_MASK ~0x00013F00ul

#define CTR_TME             0x00000001ul
#define CTR_CRBE            0x00000002ul
#define CTR_COMPRE          0x00000100ul
#define CTR_COMUS           0x00000200ul
#define CTR_CHCCDS          0x00010000ul

#define CH0ICFR_CH0SRC      0x80000000ul
#define CHICFR_CHF_MASK     ~0x0000000Ful
#define CHICFR_CHCCS_MASK   ~0x00030000ul
#define CHICFR_CHPSC_MASK   ~0x000C0000ul

#define CHOCFR_REFCE        0x00000008ul
#define CHOCFR_CHPRE        0x00000010ul
#define CHOCFR_IMAE         0x00000020ul
#define CHOCFR_CHOM_MASK    ~0x00000107ul

#define CHPOLR_CH0P         0x00000001ul
#define CHPOLR_CH1P         0x00000004ul

#define CHBRKCTR_CHMOE      0x00000010ul
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/
static void
mctm_CHx_Config(HT_MCTM_TypeDef* MCTMx, MCTM_CH_Enum Ch, MCTM_CHP_Enum Pol, MCTM_CHCCS_Enum Sel, u8 Filter);

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup MCTM_Exported_Functions MCTM exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the MCTMx peripheral registers to their default reset values.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @retval None
 ************************************************************************************************************/
void MCTM_DeInit(HT_MCTM_TypeDef* MCTMx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  if (MCTMx == HT_MCTM0)
  {
    RSTCUReset.Bit.MCTM0 = 1;
  }
  else
  {
    RSTCUReset.Bit.MCTM1 = 1;
  }

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initialize the MCTMx counter to reload, prescaler, counter mode and repetition counter.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param TimeBaseInit: Point to a \ref MCTM_TimeBaseInitTypeDef that contains the configuration information.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimeBaseInit(HT_MCTM_TypeDef* MCTMx, MCTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CNT_MODE(TimeBaseInit->CounterMode));
  Assert_Param(IS_MCTM_PSC_RLD(TimeBaseInit->PSCReloadTime));

  /* Set the counter reload value                                                                           */
  MCTMx->CRR = TimeBaseInit->CounterReload;

  /* Set the Prescaler value                                                                                */
  MCTMx->PSCR = TimeBaseInit->Prescaler;

  /* Select the Counter Mode                                                                                */
  MCTMx->CNTCFR &= CNTCFR_CMSEL_MASK;        /* CNTCFR_DIR is read only when the timer configured as        */
  MCTMx->CNTCFR &= ~(u32)CNTCFR_DIR;         /* Center-aligned mode. Reset mode first and then reset the    */
                                             /* CNTCFR_DIR bit (separate as two steps).                     */

  MCTMx->CNTCFR |= TimeBaseInit->CounterMode;

  /* Set the Repetition value                                                                               */
  MCTMx->REPR = TimeBaseInit->RepetitionCounter;

  /* To reload the Prescaler value immediatly or next update event 1                                        */
  MCTMx->EVGR = TimeBaseInit->PSCReloadTime;
}

/*********************************************************************************************************//**
 * @brief Initialize the MCTMx channel N output.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param OutInit: Point to a \ref MCTM_OutputInitTypeDef structure that contains
                   the configuration information.
 * @retval None
 ************************************************************************************************************/
void MCTM_OutputInit(HT_MCTM_TypeDef* MCTMx, MCTM_OutputInitTypeDef* OutInit)
{
  vu32 *pOcfr = (vu32*)&MCTMx->CH0OCFR + OutInit->Channel;
  vu32 *pCcr = (vu32*)&MCTMx->CH0CCR + OutInit->Channel;
  vu32 *pAcr = (vu32*)&MCTMx->CH0ACR + OutInit->Channel;
  u8 bChPos = OutInit->Channel << 1;
  u32 wTmpMask = ~(0x3ul << bChPos);
  u32 wTmpReg;

