Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_mctm.c
/*********************************************************************************************************//**
 * @brief Configure external trigger input (ETI) of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg MCTM_ETIPSC_OFF : ETI prescaler off
 *        @arg MCTM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg MCTM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg MCTM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg MCTM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg MCTM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void MCTM_EtiConfig(HT_MCTM_TypeDef* MCTMx, MCTM_ETIPSC_Enum Psc, MCTM_ETIPOL_Enum Pol, u8 Filter)
{
  u32 wTrcfr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_ETIPSC(Psc));
  Assert_Param(IS_MCTM_ETIPOL(Pol));
  Assert_Param(IS_MCTM_FILTER(Filter));

  /* Get TRCFR value with cleared ETI configuration bits                                                    */
  wTrcfr = MCTMx->TRCFR & TRCFR_ETI_CONF_MASK;

  /* Set the prescaler, filter and polarity for ETI input                                                   */
  wTrcfr |= (u32)Psc | Pol | ((u32)Filter << 8);

  /* Write to MCTMx TRCFR                                                                                   */
  MCTMx->TRCFR = wTrcfr;
}

/*********************************************************************************************************//**
 * @brief Configure prescaler of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Psc: Specify the prescaler value.
 * @param PscReloadTime: Specify the MCTM prescaler reload time.
 *        This parameter can be one of the following values:
 *        @arg MCTM_PSC_RLD_UPDATE    : The prescaler is loaded at the next update event 1.
 *        @arg MCTM_PSC_RLD_IMMEDIATE : The prescaler is loaded immediatly.
 * @retval None
 ************************************************************************************************************/
void MCTM_PrescalerConfig(HT_MCTM_TypeDef* MCTMx, u16 Psc, MCTM_PSC_RLD_Enum PscReloadTime)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_PSC_RLD(PscReloadTime));

  /* Set the prescaler value                                                                                */
  MCTMx->PSCR = Psc;

  /* Set the UEV1G bit or not                                                                               */
  MCTMx->EVGR = PscReloadTime;
}

/*********************************************************************************************************//**
 * @brief Configure counter mode of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Mod: Specify the counter mode to be used.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CNT_MODE_UP   : MCTM up counting mode.
 *        @arg MCTM_CNT_MODE_DOWN : MCTM down counting mode.
 *        @arg MCTM_CNT_MODE_CA1  : MCTM center aligned mode 1.
 *        @arg MCTM_CNT_MODE_CA2  : MCTM center aligned mode 2.
 *        @arg MCTM_CNT_MODE_CA3  : MCTM center aligned mode 3.
 * @retval None
 ************************************************************************************************************/
void MCTM_CounterModeConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CNT_MODE_Enum Mod)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CNT_MODE(Mod));

  /* Reset the CMSEL and DIR Bits                                                                           */
  MCTMx->CNTCFR &= CNTCFR_CMSEL_MASK;        /* CNTCFR_DIR is read only when the timer configured as        */
  MCTMx->CNTCFR &= ~(u32)CNTCFR_DIR;         /* Center-aligned mode. Reset mode first and then reset the    */
                                             /* CNTCFR_DIR bit (separate as two steps).                     */

  /* Set the Counter Mode                                                                                   */
  MCTMx->CNTCFR |= Mod;
}

/*********************************************************************************************************//**
 * @brief Select the STI source.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Store the STI source.
 *        This parameter can be one of the following:
 *        @arg MCTM_TRSEL_ITI0  : Internal trigger 0.
 *        @arg MCTM_TRSEL_ITI1  : Internal trigger 1.
 *        @arg MCTM_TRSEL_ITI2  : Internal trigger 2.
 *        @arg MCTM_TRSEL_TI0BED : TI0 both edge detector.
 *        @arg MCTM_TRSEL_TI0S0 : Filtered channel 0 input.
 *        @arg MCTM_TRSEL_TI1S1 : Filtered channel 1 input.
 *        @arg MCTM_TRSEL_ETIF  : External trigger input.
 *        @arg MCTM_TRSEL_UEV1G : Trigger by setting UEV1G bit.
 * @retval None
 ************************************************************************************************************/
void MCTM_StiConfig(HT_MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Sel)
{
  u32 wTrcfr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_TRSEL(Sel));

  /* Disable slave mode                                                                                     */
  MCTMx->MDCFR &= MDCFR_SMSEL_MASK;

  /* Get the TRCFR value with cleared TRSEL                                                                 */
  wTrcfr = MCTMx->TRCFR & TRCFR_TRSEL_MASK;

  /* Set the STI source                                                                                     */
  MCTMx->TRCFR |= wTrcfr | Sel;
}

