Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_mctm.c
/*********************************************************************************************************//**
 * @brief Configure encoder interface of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param DecoderMod: Specify the MCTMx decoder mode.
 *        This parameter can be one of the following values:
 *        @arg MCTM_SMSEL_DECODER1 : Counter counts on CH0 edge depending on CH1 level.
 *        @arg MCTM_SMSEL_DECODER2 : Counter counts on CH1 edge depending on CH0 level.
 *        @arg MCTM_SMSEL_DECODER3 : Counter counts on both CH0 and CH1 edges depending on
 *             the level of the other input.
 * @param CH0P: Specify the CH0 polarity.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg MCTM_CHP_INVERTED    : Active low level or falling edge
 * @param CH1P: Specify the CH1 polarity.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg MCTM_CHP_INVERTED    : Active low level or falling edge
 * @retval None
 ************************************************************************************************************/
void MCTM_DecoderConfig(HT_MCTM_TypeDef* MCTMx, MCTM_SMSEL_Enum DecoderMod,
                        MCTM_CHP_Enum CH0P, MCTM_CHP_Enum CH1P)
{
  u32 wMdcfr, wCh0Icfr, wCh1Icfr, wChpolr;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_SMSEL_DECODER(DecoderMod));
  Assert_Param(IS_MCTM_CHP(CH0P));
  Assert_Param(IS_MCTM_CHP(CH1P));

  /* Get the MCTMx MDCFR register value                                                                     */
  wMdcfr = MCTMx->MDCFR;

  /* Get the MCTMx CH0ICFR & CH1ICFR register value                                                         */
  wCh0Icfr = MCTMx->CH0ICFR;
  wCh1Icfr = MCTMx->CH1ICFR;

  /* Get the MCTMx CHPOLR register value                                                                    */
  wChpolr = MCTMx->CHPOLR;

  /* Set the decoder mode                                                                                   */
  wMdcfr &= MDCFR_SMSEL_MASK;
  wMdcfr |= DecoderMod;

  /* Select the channel 0 and the channel 1 as input and clear CH0SRC                                       */
  wCh0Icfr &= CHICFR_CHCCS_MASK & (~CH0ICFR_CH0SRC);
  wCh1Icfr &= CHICFR_CHCCS_MASK;
  wCh0Icfr |= MCTM_CHCCS_DIRECT;
  wCh1Icfr |= MCTM_CHCCS_DIRECT;

  /* Set the CH0 and the CH1 polarities                                                                     */
  wChpolr &= ~(CHPOLR_CH0P | CHPOLR_CH1P);
  wChpolr |= (CH0P | (CH1P << 2));

  /* Write to MCTMx MDCFR                                                                                   */
  MCTMx->MDCFR = wMdcfr;

  /* Write to MCTMx CH0ICFR & CH1ICFR                                                                       */
  MCTMx->CH0ICFR = wCh0Icfr;
  MCTMx->CH1ICFR = wCh1Icfr;

  /* Write to MCTMx CHPOLR                                                                                  */
  MCTMx->CHPOLR = wChpolr;
}

/*********************************************************************************************************//**
 * @brief Force the MCTMx CH0OREF waveform to active or inactive level.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg MCTM_OM_FORCED_ACTIVE   : Forced active level on CH0OREF
 *        @arg MCTM_OM_FORCED_INACTIVE : Forced inactive level on CH0OREF.
 * @retval None
 ************************************************************************************************************/
void MCTM_ForcedOREF0(HT_MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  MCTMx->CH0OCFR = (MCTMx->CH0OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force the MCTMx CH1OREF waveform to active or inactive level.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg MCTM_OM_FORCED_ACTIVE   : Force active level on CH1OREF
 *        @arg MCTM_OM_FORCED_INACTIVE : Force inactive level on CH1OREF.
 * @retval None
 ************************************************************************************************************/
void MCTM_ForcedOREF1(HT_MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  MCTMx->CH1OCFR = (MCTMx->CH1OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force the MCTMx CH2OREF waveform to active or inactive level.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg MCTM_OM_FORCED_ACTIVE   : Force active level on CH2OREF
 *        @arg MCTM_OM_FORCED_INACTIVE : Force inactive level on CH2OREF.
 * @retval None
 ************************************************************************************************************/
void MCTM_ForcedOREF2(HT_MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_OM_FORCED(ForcedAction));

