Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_mctm.c
/*********************************************************************************************************//**
 * @brief Select master trigger output source of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the master trigger output source.
 *        This parameter can be as follow:
 *        @arg MCTM_MMSEL_RESET   : Send trigger signal when S/W setting UEV1G or slave restart
 *        @arg MCTM_MMSEL_ENABLE  : The counter enable signal is used as trigger output.
 *        @arg MCTM_MMSEL_UPDATE  : The update event 1 is used as trigger output.
 *        @arg MCTM_MMSEL_CH0CC   : Channel 0 capture or compare match occurred as trigger output.
 *        @arg MCTM_MMSEL_CH0OREF : The CH0OREF signal is used as trigger output.
 *        @arg MCTM_MMSEL_CH1OREF : The CH1OREF signal is used as trigger output.
 *        @arg MCTM_MMSEL_CH2OREF : The CH2OREF signal is used as trigger output.
 *        @arg MCTM_MMSEL_CH3OREF : The CH3OREF signal is used as trigger output.
 * @retval None
 ************************************************************************************************************/
void MCTM_MMSELConfig(HT_MCTM_TypeDef* MCTMx, MCTM_MMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_MMSEL(Sel));

  /* Select the MTO source                                                                                  */
  MCTMx->MDCFR = (MCTMx->MDCFR & MDCFR_MMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Select slave mode of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the timer slave mode.
 *        This parameter can be one of the following values:
 *        @arg MCTM_SMSEL_RESTART : Slave restart counter mode.
 *        @arg MCTM_SMSEL_PAUSE   : Slave pause counter mode.
 *        @arg MCTM_SMSEL_TRIGGER : Slave trigger counter start mode.
 *        @arg MCTM_SMSEL_STIED   : Used rising edge of STI as prescaler clock source.
 * @retval None
 ************************************************************************************************************/
void MCTM_SlaveModeConfig(HT_MCTM_TypeDef* MCTMx, MCTM_SMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_SLAVE_MODE(Sel));

  /* Select the slave mode                                                                                  */
  MCTMx->MDCFR = (MCTMx->MDCFR & MDCFR_SMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the master & slave MCTMx synchronous function.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimSyncCmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the TSE Bit                                                                                      */
    MCTMx->MDCFR |= MDCFR_TSE;
  }
  else
  {
    /* Reset the TSE Bit                                                                                    */
    MCTMx->MDCFR &= ~MDCFR_TSE;
  }
}

/*********************************************************************************************************//**
 * @brief Set counter register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Counter: Specify the counter register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCounter(HT_MCTM_TypeDef* MCTMx, u16 Counter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the Counter Register value                                                                         */
  MCTMx->CNTR = Counter;
}

/*********************************************************************************************************//**
 * @brief Set counter reload register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCounterReload(HT_MCTM_TypeDef* MCTMx, u16 Reload)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the counter reload register value                                                                  */
  MCTMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare0(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH0CCR register new value                                                                      */
  MCTMx->CH0CCR = Cmp;
}

