Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_mctm.c
/*********************************************************************************************************//**
 * @brief Set channel 1 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH1CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare1(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH1CCR register new value                                                                      */
  MCTMx->CH1CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH2CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare2(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH2CCR register new value                                                                      */
  MCTMx->CH2CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare3(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH3CCR register new value                                                                      */
  MCTMx->CH3CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH0ACR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare0(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH0ACR register new value                                                                      */
  MCTMx->CH0ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH1ACCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare1(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH1ACR register new value                                                                      */
  MCTMx->CH1ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH2ACR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare2(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH2ACR register new value                                                                      */
  MCTMx->CH2ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 asymmetric compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH3ACR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetAsymmetricCompare3(HT_MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH3ACR register new value                                                                      */
  MCTMx->CH3ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Configure input capture prescaler.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Channel: Specify the MCTM channel.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CH_0 : MCTM channel 0
 *        @arg MCTM_CH_1 : MCTM channel 1
 *        @arg MCTM_CH_2 : MCTM channel 2
 *        @arg MCTM_CH_3 : MCTM channel 3
 * @param Psc: Specify the input capture prescaler new value.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHPSC_OFF : No prescaler
 *        @arg MCTM_CHPSC_2   : Capture is done once every 2 events
 *        @arg MCTM_CHPSC_4   : Capture is done once every 4 events
 *        @arg MCTM_CHPSC_8   : Capture is done once every 8 events
 * @retval None
 ************************************************************************************************************/
void MCTM_CHPSCConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHPSC_Enum Psc)
{
  vu32 *pIcfr = (vu32*)&MCTMx->CH0ICFR + Channel;

