Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_mctm.c
/*********************************************************************************************************//**
 * @brief Generate MCTMx events.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_EVENT: Stores the event source.
 *        This parameter can be any combination of following:
 *        @arg MCTM_EVENT_CH0CC     : Timer Capture/compare 0 event
 *        @arg MCTM_EVENT_CH1CC     : Timer Capture/compare 1 event
 *        @arg MCTM_EVENT_CH2CC     : Timer Capture/compare 2 event
 *        @arg MCTM_EVENT_CH3CC     : Timer Capture/compare 3 event
 *        @arg MCTM_EVENT_UEV1      : Timer update event 1
 *        @arg MCTM_EVENT_UEV2      : Timer update event 2
 *        @arg MCTM_EVENT_TEV       : Timer trigger event
 *        @arg MCTM_EVENT_BRKEV     : Timer break event
 * @retval None
 ************************************************************************************************************/
void MCTM_GenerateEvent(HT_MCTM_TypeDef* MCTMx, u32 MCTM_EVENT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_EVENT(MCTM_EVENT));

  /* Set the event sources                                                                                  */
  MCTMx->EVGR = MCTM_EVENT;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified MCTMx flag has been set.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_FLAG: Specify the flag to be checked.
 *        This parameter can be one of the following values:
 *        @arg MCTM_FLAG_CH0CC    : MCTM Capture/compare 0 flag
 *        @arg MCTM_FLAG_CH1CC    : MCTM Capture/compare 1 flag
 *        @arg MCTM_FLAG_CH2CC    : MCTM Capture/compare 2 flag
 *        @arg MCTM_FLAG_CH3CC    : MCTM Capture/compare 3 flag
 *        @arg MCTM_FLAG_CH0OC    : MCTM channel 0 overcapture flag
 *        @arg MCTM_FLAG_CH1OC    : MCTM channel 1 overcapture flag
 *        @arg MCTM_FLAG_CH2OC    : MCTM channel 2 overcapture flag
 *        @arg MCTM_FLAG_CH3OC    : MCTM channel 3 overcapture flag
 *        @arg MCTM_FLAG_UEV1     : MCTM update 1 flag
 *        @arg MCTM_FLAG_UEV2     : MCTM update 2 flag
 *        @arg MCTM_FLAG_TEV      : MCTM trigger flag
 *        @arg MCTM_FLAG_BRK0     : MCTM break 0 flag
 *        @arg MCTM_FLAG_BRK1     : MCTM break 1 flag
 * @return The new state of MCTM_FLAG (SET or RESET).
 ************************************************************************************************************/
FlagStatus MCTM_GetFlagStatus(HT_MCTM_TypeDef* MCTMx, u32 MCTM_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_FLAG(MCTM_FLAG));

  if ((MCTMx->INTSR & MCTM_FLAG) != 0)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear flags of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_FLAG: Specify the flag to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg MCTM_FLAG_CH0CC    : MCTM Capture/compare 0 flag
 *        @arg MCTM_FLAG_CH1CC    : MCTM Capture/compare 1 flag
 *        @arg MCTM_FLAG_CH2CC    : MCTM Capture/compare 2 flag
 *        @arg MCTM_FLAG_CH3CC    : MCTM Capture/compare 3 flag
 *        @arg MCTM_FLAG_CH0OC    : MCTM channel 0 overcapture flag
 *        @arg MCTM_FLAG_CH1OC    : MCTM channel 1 overcapture flag
 *        @arg MCTM_FLAG_CH2OC    : MCTM channel 2 overcapture flag
 *        @arg MCTM_FLAG_CH3OC    : MCTM channel 3 overcapture flag
 *        @arg MCTM_FLAG_UEV1     : MCTM update 1 flag
 *        @arg MCTM_FLAG_UEV2     : MCTM update 2 flag
 *        @arg MCTM_FLAG_TEV      : MCTM trigger flag
 *        @arg MCTM_FLAG_BRK0     : MCTM break 0 flag
 *        @arg MCTM_FLAG_BRK1     : MCTM break 1 flag
 * @retval None
 ************************************************************************************************************/
void MCTM_ClearFlag(HT_MCTM_TypeDef* MCTMx, u32 MCTM_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_FLAG_CLR(MCTM_FLAG));

  /* Clear the flags                                                                                        */
  MCTMx->INTSR = ~MCTM_FLAG;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-M3 when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified interrupts of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_INT: Specify the MCTM interrupts sources to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg MCTM_INT_CH0CC     : MCTM Capture/compare 0 interrupt
 *        @arg MCTM_INT_CH1CC     : MCTM Capture/compare 1 interrupt
 *        @arg MCTM_INT_CH2CC     : MCTM Capture/compare 2 interrupt
 *        @arg MCTM_INT_CH3CC     : MCTM Capture/compare 3 interrupt
 *        @arg MCTM_INT_UEV1      : MCTM update 1 interrupt
 *        @arg MCTM_INT_UEV2      : MCTM update 2 interrupt
 *        @arg MCTM_INT_TEV       : MCTM trigger interrupt
 *        @arg MCTM_INT_BRKEV     : MCTM break interrupt
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_IntConfig(HT_MCTM_TypeDef* MCTMx, u32 MCTM_INT, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_INT(MCTM_INT));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the interrupt sources                                                                         */
    MCTMx->DICTR |= MCTM_INT;
  }
  else
  {
    /* Disable the interrupt sources                                                                        */
    MCTMx->DICTR &= ~MCTM_INT;
  }
}

